
// Αναπαράσταση των διαφορετικών κατηγοριών προϊόντων
//Το enum ProductCategory ορίζει μια συλλογή από
// σταθερές τιμές που αντιπροσωπεύουν τις διαφορετικές κατηγορίες προϊόντων
// που μπορούν να υπάρχουν στο σύστημά μας.
public enum ProductCategory {
    OS,      // Λειτουργικά Συστήματα
    APPS,   // Εφαρμογές
    PERIPHERALS,   // Περιφερειακά
   COMPONENTS   // Υποσυστήματα
}

//Χρησιμοποιούμε αυτές τις κατηγορίες για να ορίσουμε τον τύπο του προϊόντος που δημιουργούμε
// ή που θα παραγγείλουμε στο σύστημά μας, βοηθώντας έτσι στην οργάνωση και τη διαχείριση των προϊόντων.